open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_ptt.c
/****************************************************************************
 * tests/host/bk7258/test_bk7258_voice_ptt.c
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

#include <assert.h>
#include <errno.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <time.h>

#include "bk7258_voice_ptt.h"

#define TEST_TRACE_MAX 64u

enum test_call_e
{
  TEST_MIC_ACQUIRE = 1,
  TEST_MIC_PREPARE,
  TEST_MIC_START,
  TEST_SOURCE_ATTACH,
  TEST_SINK_START,
  TEST_SINK_AUDIO,
  TEST_SOURCE_INTERRUPT,
  TEST_MIC_STOP,
  TEST_SOURCE_DETACH,
  TEST_MIC_DRAIN,
  TEST_MIC_RELEASE,
  TEST_SINK_END,
  TEST_SINK_CANCEL,
  TEST_DAC_ACQUIRE,
  TEST_DAC_PREPARE,
  TEST_DAC_START,
  TEST_DAC_WRITE,
  TEST_DAC_DRAIN,
  TEST_DAC_STOP,
  TEST_DAC_RELEASE,
};

struct test_trace_s
{
  enum test_call_e calls[TEST_TRACE_MAX];
  size_t count;
};

struct test_audio_s
{
  struct test_trace_s *trace;
  bool mic_owned;
  bool mic_prepared;
  bool mic_started;
  bool dac_owned;
  bool dac_prepared;
  bool dac_started;
};

struct test_source_s
{
  struct test_trace_s *trace;
  struct test_audio_s *audio;
  sem_t audio_sent;
  sem_t wake_reader;
  unsigned int reads;
  unsigned int interrupts;
  bool attached;
  bool wake_on_interrupt;
};

struct test_sink_s
{
  struct test_trace_s *trace;
  struct test_source_s *source;
  struct test_audio_s *audio;
  struct bkvoice_turn_token_s token;
  unsigned int audio_calls;
  unsigned int end_calls;
  unsigned int cancel_calls;
  uint8_t audio_markers[64];
  int audio_error;
  int cancel_reason;
};

struct test_prefill_s
{
  struct test_source_s *source;
  unsigned int read_calls;
  size_t fail_index;
  int error;
};

struct test_live_observer_s
{
  const struct test_sink_s *sink;
  unsigned int calls;
  uint8_t marker;
};

static const struct bkvoice_turn_limits_s g_turn_limits =
{
  .capture_timeout_ms = 1000,
  .waiting_tts_timeout_ms = 1000,
  .playback_timeout_ms = 1000,
  .audio_frame_bytes = BKVOICE_CAPTURE_FRAME_BYTES,
};

static void test_trace(struct test_trace_s *trace, enum test_call_e call)
{
  assert(trace->count < TEST_TRACE_MAX);
  trace->calls[trace->count++] = call;
}

static void test_sem_wait(sem_t *sem)
{
  struct timespec deadline;
  int ret;

  assert(clock_gettime(CLOCK_REALTIME, &deadline) == 0);
  deadline.tv_sec += 2;
  do
    {
      ret = sem_timedwait(sem, &deadline);
    }
  while (ret < 0 && errno == EINTR);

  assert(ret == 0);
}

static int test_mic_acquire(void *context)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_MIC_ACQUIRE);
  assert(!audio->mic_owned && !audio->dac_owned);
  audio->mic_owned = true;
  return 0;
}

static int test_mic_prepare(void *context)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_MIC_PREPARE);
  assert(audio->mic_owned && !audio->mic_prepared);
  audio->mic_prepared = true;
  return 0;
}

static int test_mic_start(void *context)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_MIC_START);
  assert(audio->mic_prepared && !audio->mic_started);
  audio->mic_started = true;
  return 0;
}

static int test_mic_stop(void *context)
{
  struct test_audio_s *audio = context;

  assert(audio->mic_owned);
  if (audio->mic_started)
    {
      test_trace(audio->trace, TEST_MIC_STOP);
      audio->mic_started = false;
    }

  return 0;
}

static int test_mic_drain(void *context)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_MIC_DRAIN);
  assert(audio->mic_owned && audio->mic_prepared && !audio->mic_started);
  return 0;
}

static int test_mic_release(void *context)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_MIC_RELEASE);
  assert(audio->mic_owned && !audio->mic_started);
  audio->mic_owned = false;
  audio->mic_prepared = false;
  return 0;
}

static int test_dac_acquire(void *context)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_DAC_ACQUIRE);
  assert(!audio->mic_owned && !audio->dac_owned);
  audio->dac_owned = true;
  return 0;
}

static int test_dac_prepare(void *context)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_DAC_PREPARE);
  audio->dac_prepared = true;
  return 0;
}

static int test_dac_start(void *context)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_DAC_START);
  audio->dac_started = true;
  return 0;
}

static ssize_t test_dac_write(void *context, const uint8_t *pcm,
                              size_t bytes)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_DAC_WRITE);
  assert(audio->dac_started && pcm != NULL);
  return (ssize_t)bytes;
}

static int test_dac_drain(void *context)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_DAC_DRAIN);
  return 0;
}

static int test_dac_stop(void *context)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_DAC_STOP);
  audio->dac_started = false;
  return 0;
}

static int test_dac_release(void *context)
{
  struct test_audio_s *audio = context;

  test_trace(audio->trace, TEST_DAC_RELEASE);
  audio->dac_owned = false;
  audio->dac_prepared = false;
  return 0;
}

static const struct bkvoice_turn_audio_ops_s g_audio_ops =
{
  .mic_acquire = test_mic_acquire,
  .mic_prepare = test_mic_prepare,
  .mic_start = test_mic_start,
  .mic_stop = test_mic_stop,
  .mic_drain = test_mic_drain,
  .mic_release = test_mic_release,
  .dac_acquire = test_dac_acquire,
  .dac_prepare = test_dac_prepare,
  .dac_start = test_dac_start,
  .dac_write = test_dac_write,
  .dac_drain = test_dac_drain,
  .dac_stop = test_dac_stop,
  .dac_release = test_dac_release,
};

static int test_source_attach(void *context)
{
  struct test_source_s *source = context;

  test_trace(source->trace, TEST_SOURCE_ATTACH);
  assert(!source->attached && source->audio->mic_started);
  source->attached = true;
  return 0;
}

static ssize_t test_source_read(void *context, void *pcm, size_t bytes)
{
  struct test_source_s *source = context;
  int ret;

  assert(source->attached && pcm != NULL && bytes != 0);
  source->reads++;
  if (source->reads == 1)
    {
      assert(bytes == BKVOICE_CAPTURE_FRAME_BYTES);
      memset(pcm, 0x5a, bytes);
      return (ssize_t)bytes;
    }

  do
    {
      ret = sem_wait(&source->wake_reader);
    }
  while (ret < 0 && errno == EINTR);

  assert(ret == 0);
  return -EPIPE;
}

static int test_source_interrupt(void *context)
{
  struct test_source_s *source = context;

  test_trace(source->trace, TEST_SOURCE_INTERRUPT);
  assert(source->attached);
  source->interrupts++;
  (void)test_mic_stop(source->audio);
  if (source->wake_on_interrupt)
    {
      assert(sem_post(&source->wake_reader) == 0);
    }

