open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_ptt.c
  return 0;
}

static int test_source_detach(void *context)
{
  struct test_source_s *source = context;

  test_trace(source->trace, TEST_SOURCE_DETACH);
  assert(source->attached);
  source->attached = false;
  return 0;
}

static const struct bkvoice_capture_source_ops_s g_source_ops =
{
  .attach = test_source_attach,
  .read = test_source_read,
  .interrupt = test_source_interrupt,
  .detach = test_source_detach,
};

static int test_sink_start(void *context,
                           const struct bkvoice_turn_token_s *token)
{
  struct test_sink_s *sink = context;

  test_trace(sink->trace, TEST_SINK_START);
  memcpy(&sink->token, token, sizeof(*token));
  return 0;
}

static int test_sink_audio(void *context,
                           const struct bkvoice_turn_token_s *token,
                           const uint8_t *pcm, size_t bytes)
{
  struct test_sink_s *sink = context;

  test_trace(sink->trace, TEST_SINK_AUDIO);
  assert(memcmp(token, &sink->token, sizeof(*token)) == 0);
  assert(pcm != NULL && bytes == BKVOICE_CAPTURE_FRAME_BYTES);
  assert(sink->audio_calls < sizeof(sink->audio_markers));
  sink->audio_markers[sink->audio_calls] = pcm[0];
  sink->audio_calls++;
  assert(sem_post(&sink->source->audio_sent) == 0);
  return sink->audio_error;
}

static int test_prefill_read(
  void *context, size_t frame_index,
  uint8_t pcm[BKVOICE_CAPTURE_FRAME_BYTES])
{
  struct test_prefill_s *prefill = context;

  assert(prefill != NULL && prefill->source != NULL && pcm != NULL);
  assert(prefill->source->attached && prefill->source->reads == 0);
  assert(frame_index == prefill->read_calls);
  prefill->read_calls++;
  if (prefill->error < 0 && frame_index == prefill->fail_index)
    {
      return prefill->error;
    }

  memset(pcm, (int)(0xa0u + frame_index),
         BKVOICE_CAPTURE_FRAME_BYTES);
  return 0;
}

static void test_live_observe(
  void *context, const struct bkvoice_turn_token_s *token,
  const uint8_t pcm[BKVOICE_CAPTURE_FRAME_BYTES])
{
  struct test_live_observer_s *observer = context;

  assert(observer != NULL && observer->sink != NULL && token != NULL &&
         pcm != NULL);
  assert(memcmp(token, &observer->sink->token, sizeof(*token)) == 0);
  observer->calls++;
  observer->marker = pcm[0];
}

static int test_sink_end(void *context,
                         const struct bkvoice_turn_token_s *token)
{
  struct test_sink_s *sink = context;

  test_trace(sink->trace, TEST_SINK_END);
  assert(memcmp(token, &sink->token, sizeof(*token)) == 0);
  assert(!sink->audio->mic_owned);
  sink->end_calls++;
  return 0;
}

static int test_sink_cancel(void *context,
                            const struct bkvoice_turn_token_s *token,
                            int reason)
{
  struct test_sink_s *sink = context;

  test_trace(sink->trace, TEST_SINK_CANCEL);
  assert(memcmp(token, &sink->token, sizeof(*token)) == 0);
  assert(reason < 0);
  sink->cancel_calls++;
  sink->cancel_reason = reason;
  return 0;
}

static const struct bkvoice_capture_sink_ops_s g_sink_ops =
{
  .start = test_sink_start,
  .audio = test_sink_audio,
  .end = test_sink_end,
  .cancel = test_sink_cancel,
};

static void test_initialize(struct bkvoice_ptt_s *ptt,
                            struct test_trace_s *trace,
                            struct test_audio_s *audio,
                            struct test_source_s *source,
                            struct test_sink_s *sink,
                            uint32_t join_timeout_ms)
{
  const struct bkvoice_ptt_worker_config_s worker_config =
  {
    .stack_size = 0,
    .priority = 0,
    .join_timeout_ms = join_timeout_ms,
  };

  memset(ptt, 0, sizeof(*ptt));
  memset(trace, 0, sizeof(*trace));
  memset(audio, 0, sizeof(*audio));
  memset(source, 0, sizeof(*source));
  memset(sink, 0, sizeof(*sink));
  audio->trace = trace;
  source->trace = trace;
  source->audio = audio;
  source->wake_on_interrupt = true;
  sink->trace = trace;
  sink->source = source;
  sink->audio = audio;
  assert(sem_init(&source->audio_sent, 0, 0) == 0);
  assert(sem_init(&source->wake_reader, 0, 0) == 0);
  assert(bkvoice_ptt_initialize(ptt, &g_audio_ops, audio, &g_source_ops,
                                source, &g_turn_limits, &worker_config,
                                7) == 0);
  assert(bkvoice_ptt_session_open(ptt, 3, &g_sink_ops, sink) == 0);
}

static void test_destroy(struct bkvoice_ptt_s *ptt,
                         struct test_source_s *source)
{
  assert(bkvoice_ptt_uninitialize(ptt) == 0);
  assert(sem_destroy(&source->audio_sent) == 0);
  assert(sem_destroy(&source->wake_reader) == 0);
}

static void test_finish(struct bkvoice_ptt_s *ptt,
                        struct test_source_s *source)
{
  assert(bkvoice_ptt_session_close(ptt, -ENOTCONN) == 0);
  test_destroy(ptt, source);
}

static void test_normal_ptt_order(void)
{
  static const enum test_call_e expected[] =
  {
    TEST_MIC_ACQUIRE, TEST_MIC_PREPARE, TEST_MIC_START,
    TEST_SOURCE_ATTACH, TEST_SINK_START, TEST_SINK_AUDIO,
    TEST_SOURCE_INTERRUPT, TEST_MIC_STOP, TEST_SOURCE_DETACH,
    TEST_MIC_DRAIN, TEST_MIC_RELEASE, TEST_SINK_END,
  };
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 1000);
  assert(bkvoice_ptt_down(&ptt, 10, &token) == 0);
  test_sem_wait(&source.audio_sent);
  assert(bkvoice_ptt_down(&ptt, 11, &token) == -EBUSY);
  assert(bkvoice_ptt_up(&ptt, 20) == 0);
  assert(trace.count == sizeof(expected) / sizeof(expected[0]));
  assert(memcmp(trace.calls, expected, sizeof(expected)) == 0);
  assert(sink.audio_calls == 1 && sink.end_calls == 1 &&
         sink.cancel_calls == 0);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.turn.state == BKVOICE_TURN_WAITING_TTS);
  assert(snapshot.capture.state == BKVOICE_CAPTURE_IDLE);
  assert(!snapshot.worker_joinable && !audio.mic_owned && !source.attached);
  test_finish(&ptt, &source);
}

