open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_ptt.c
static void test_prefill_order(void)
{
  static const enum test_call_e expected[] =
  {
    TEST_MIC_ACQUIRE, TEST_MIC_PREPARE, TEST_MIC_START,
    TEST_SOURCE_ATTACH, TEST_SINK_START,
    TEST_SINK_AUDIO, TEST_SINK_AUDIO, TEST_SINK_AUDIO,
    TEST_SOURCE_INTERRUPT, TEST_MIC_STOP, TEST_SOURCE_DETACH,
    TEST_MIC_DRAIN, TEST_MIC_RELEASE, TEST_SINK_END,
  };
  static const uint8_t expected_audio[] = {0xa0, 0xa1, 0x5a};
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct test_live_observer_s observer;
  struct test_prefill_s prefill;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 1000);
  memset(&prefill, 0, sizeof(prefill));
  memset(&observer, 0, sizeof(observer));
  prefill.source = &source;
  observer.sink = &sink;
  assert(bkvoice_ptt_down_prefill(&ptt, 10, test_prefill_read,
                                   &prefill, 2, test_live_observe,
                                   &observer, &token) == 0);
  test_sem_wait(&source.audio_sent);
  test_sem_wait(&source.audio_sent);
  test_sem_wait(&source.audio_sent);
  assert(bkvoice_ptt_up(&ptt, 20) == 0);
  assert(trace.count == sizeof(expected) / sizeof(expected[0]));
  assert(memcmp(trace.calls, expected, sizeof(expected)) == 0);
  assert(memcmp(sink.audio_markers, expected_audio,
                sizeof(expected_audio)) == 0);
  assert(observer.calls == 1 && observer.marker == 0x5a);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.capture.frames_sent == 3);
  assert(snapshot.capture.prefill_frames_sent == 2);
  assert(snapshot.capture.bytes_sent ==
         3u * BKVOICE_CAPTURE_FRAME_BYTES);
  assert(!snapshot.worker_joinable && !audio.mic_owned && !source.attached);
  test_finish(&ptt, &source);
}

static void test_prefill_failure_cleans_up(void)
{
  static const enum test_call_e expected[] =
  {
    TEST_MIC_ACQUIRE, TEST_MIC_PREPARE, TEST_MIC_START,
    TEST_SOURCE_ATTACH, TEST_SINK_START, TEST_SINK_AUDIO,
    TEST_SOURCE_INTERRUPT, TEST_MIC_STOP, TEST_SOURCE_DETACH,
    TEST_SINK_CANCEL, TEST_MIC_DRAIN, TEST_MIC_RELEASE,
  };
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct test_prefill_s prefill;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 1000);
  memset(&prefill, 0, sizeof(prefill));
  prefill.source = &source;
  prefill.fail_index = 1;
  prefill.error = -EIO;
  assert(bkvoice_ptt_down_prefill(&ptt, 10, test_prefill_read,
                                   &prefill, 2, NULL, NULL,
                                   &token) == -EIO);
  assert(trace.count == sizeof(expected) / sizeof(expected[0]));
  assert(memcmp(trace.calls, expected, sizeof(expected)) == 0);
  assert(sink.audio_calls == 1 && sink.audio_markers[0] == 0xa0);
  assert(sink.cancel_calls == 1 && sink.cancel_reason == -EIO);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.turn.state == BKVOICE_TURN_IDLE);
  assert(snapshot.capture.state == BKVOICE_CAPTURE_IDLE);
  assert(snapshot.capture.prefill_frames_sent == 1);
  assert(snapshot.session_open && snapshot.capture_ready);
  assert(!snapshot.worker_joinable && !audio.mic_owned && !source.attached);
  test_finish(&ptt, &source);
}

static void test_worker_failure_cancels(void)
{
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 1000);
  sink.audio_error = -ENETDOWN;
  assert(bkvoice_ptt_down(&ptt, 10, &token) == 0);
  test_sem_wait(&source.audio_sent);
  assert(bkvoice_ptt_up(&ptt, 20) == -ENETDOWN);
  assert(sink.audio_calls == 1 && sink.end_calls == 0 &&
         sink.cancel_calls == 1);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.turn.state == BKVOICE_TURN_IDLE);
  assert(snapshot.capture.state == BKVOICE_CAPTURE_IDLE);
  assert(!snapshot.worker_joinable && !audio.mic_owned && !source.attached);
  test_finish(&ptt, &source);
}

static void test_join_timeout_is_retryable(void)
{
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 20);
  source.wake_on_interrupt = false;
  assert(bkvoice_ptt_down(&ptt, 10, &token) == 0);
  test_sem_wait(&source.audio_sent);
  assert(bkvoice_ptt_up(&ptt, 20) == -ETIMEDOUT);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.worker_joinable && snapshot.capture.source_attached);
  assert(snapshot.turn.mic_acquired && source.attached);

  source.wake_on_interrupt = true;
  assert(bkvoice_ptt_up(&ptt, 30) == 0);
  assert(source.interrupts == 2 && sink.end_calls == 1);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(!snapshot.worker_joinable && !snapshot.turn.mic_acquired &&
         !snapshot.capture.source_attached);
  test_finish(&ptt, &source);
}

static void test_cancel_active_capture(void)
{
  static const enum test_call_e expected[] =
  {
    TEST_MIC_ACQUIRE, TEST_MIC_PREPARE, TEST_MIC_START,
    TEST_SOURCE_ATTACH, TEST_SINK_START, TEST_SINK_AUDIO,
    TEST_SOURCE_INTERRUPT, TEST_MIC_STOP, TEST_SOURCE_DETACH,
    TEST_SINK_CANCEL, TEST_MIC_DRAIN, TEST_MIC_RELEASE,
  };
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 1000);
  assert(bkvoice_ptt_down(&ptt, 10, &token) == 0);
  test_sem_wait(&source.audio_sent);
  assert(bkvoice_ptt_cancel(&ptt, -ENOTCONN) == 0);
  assert(trace.count == sizeof(expected) / sizeof(expected[0]));
  assert(memcmp(trace.calls, expected, sizeof(expected)) == 0);
  assert(sink.end_calls == 0 && sink.cancel_calls == 1);
  assert(sink.cancel_reason == -ENOTCONN);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.turn.state == BKVOICE_TURN_IDLE);
  assert(snapshot.turn.last_error == -ENOTCONN);
  assert(snapshot.capture.state == BKVOICE_CAPTURE_IDLE);
  assert(snapshot.session_open && snapshot.capture_ready);
  assert(!snapshot.worker_joinable && !audio.mic_owned && !source.attached);
  test_finish(&ptt, &source);
}

static void test_cancel_join_timeout_is_retryable(void)
{
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 20);
  source.wake_on_interrupt = false;
  assert(bkvoice_ptt_down(&ptt, 10, &token) == 0);
  test_sem_wait(&source.audio_sent);
  assert(bkvoice_ptt_cancel(&ptt, -ENOTCONN) == -ETIMEDOUT);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.worker_joinable && snapshot.capture.source_attached);
  assert(snapshot.turn.mic_acquired && source.attached);

  source.wake_on_interrupt = true;
  assert(bkvoice_ptt_cancel(&ptt, -ENOTCONN) == 0);
  assert(source.interrupts == 2 && sink.cancel_calls == 1);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.turn.state == BKVOICE_TURN_IDLE);
  assert(!snapshot.worker_joinable && !snapshot.turn.mic_acquired &&
         !snapshot.capture.source_attached);
  test_finish(&ptt, &source);
}

