open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_ptt.c
static void test_capture_timeout(void)
{
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 1000);
  assert(bkvoice_ptt_down(&ptt, 10, &token) == 0);
  test_sem_wait(&source.audio_sent);
  assert(bkvoice_ptt_timeout(&ptt, 1009) == -EAGAIN);
  assert(source.interrupts == 0);
  assert(bkvoice_ptt_timeout(&ptt, 1010) == 0);
  assert(sink.end_calls == 0 && sink.cancel_calls == 1);
  assert(sink.cancel_reason == -ETIMEDOUT);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.turn.state == BKVOICE_TURN_IDLE);
  assert(snapshot.turn.last_error == -ETIMEDOUT);
  assert(snapshot.capture.state == BKVOICE_CAPTURE_IDLE);
  assert(snapshot.session_open && snapshot.capture_ready);
  assert(!snapshot.worker_joinable && !audio.mic_owned && !source.attached);
  test_finish(&ptt, &source);
}

static void test_waiting_tts_timeout(void)
{
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 1000);
  assert(bkvoice_ptt_down(&ptt, 10, &token) == 0);
  test_sem_wait(&source.audio_sent);
  assert(bkvoice_ptt_up(&ptt, 20) == 0);
  assert(bkvoice_ptt_timeout(&ptt, 1019) == -EAGAIN);
  assert(bkvoice_ptt_timeout(&ptt, 1020) == 0);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.turn.state == BKVOICE_TURN_IDLE);
  assert(snapshot.turn.last_error == -ETIMEDOUT);
  assert(sink.end_calls == 1 && sink.cancel_calls == 0);
  assert(snapshot.session_open && snapshot.capture_ready);
  test_finish(&ptt, &source);
}

static void test_session_close_stops_active_capture(void)
{
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 1000);
  assert(bkvoice_ptt_down(&ptt, 10, &token) == 0);
  test_sem_wait(&source.audio_sent);
  assert(bkvoice_ptt_session_close(&ptt, -ENOTCONN) == 0);
  assert(sink.end_calls == 0 && sink.cancel_calls == 1);
  assert(sink.cancel_reason == -ENOTCONN);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.turn.state == BKVOICE_TURN_IDLE);
  assert(!snapshot.session_open && !snapshot.capture_ready);
  assert(!snapshot.worker_joinable && !audio.mic_owned && !source.attached);
  test_destroy(&ptt, &source);
}

static void test_session_close_join_timeout_is_retryable(void)
{
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 20);
  source.wake_on_interrupt = false;
  assert(bkvoice_ptt_down(&ptt, 10, &token) == 0);
  test_sem_wait(&source.audio_sent);
  assert(bkvoice_ptt_session_close(&ptt, -ENOTCONN) == -ETIMEDOUT);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.session_open && snapshot.capture_ready);
  assert(snapshot.worker_joinable && snapshot.capture.source_attached);

  source.wake_on_interrupt = true;
  assert(bkvoice_ptt_session_close(&ptt, -ENOTCONN) == 0);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(!snapshot.session_open && !snapshot.capture_ready);
  assert(!snapshot.worker_joinable && !audio.mic_owned && !source.attached);
  test_destroy(&ptt, &source);
}

static void test_control_sequence_overflow_is_terminal(void)
{
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 1000);
  ptt.turn.last_control_sequence = UINT32_MAX - 2u;
  assert(bkvoice_ptt_down(&ptt, 10, &token) == 0);
  assert(token.sequence == UINT32_MAX - 1u);
  test_sem_wait(&source.audio_sent);
  assert(bkvoice_ptt_up(&ptt, 20) == -EOVERFLOW);
  assert(sink.end_calls == 0 && sink.cancel_calls == 1);
  assert(sink.cancel_reason == -EOVERFLOW);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.turn.state == BKVOICE_TURN_IDLE);
  assert(snapshot.turn.last_error == -EOVERFLOW);
  assert(!snapshot.session_open && !snapshot.capture_ready);
  assert(!snapshot.worker_joinable && !audio.mic_owned && !source.attached);
  test_destroy(&ptt, &source);
}

static void test_idle_control_sequence_overflow_is_terminal(void)
{
  struct bkvoice_ptt_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_ptt_s ptt;
  struct test_trace_s trace;
  struct test_audio_s audio;
  struct test_source_s source;
  struct test_sink_s sink;

  test_initialize(&ptt, &trace, &audio, &source, &sink, 1000);
  ptt.turn.last_control_sequence = UINT32_MAX - 1u;
  assert(bkvoice_ptt_down(&ptt, 10, &token) == -EOVERFLOW);
  bkvoice_ptt_snapshot(&ptt, &snapshot);
  assert(snapshot.turn.state == BKVOICE_TURN_IDLE);
  assert(snapshot.turn.last_error == -EOVERFLOW);
  assert(!snapshot.session_open && !snapshot.capture_ready);
  assert(!snapshot.worker_joinable && trace.count == 0);
  test_destroy(&ptt, &source);
}

static void test_guards(void)
{
  struct bkvoice_ptt_worker_config_s config =
  {
    .stack_size = 0,
    .priority = 0,
    .join_timeout_ms = 0,
  };
  struct bkvoice_ptt_s ptt;
  struct test_audio_s audio;
  struct test_source_s source;

  memset(&ptt, 0, sizeof(ptt));
  memset(&audio, 0, sizeof(audio));
  memset(&source, 0, sizeof(source));
  assert(bkvoice_ptt_initialize(NULL, &g_audio_ops, &audio, &g_source_ops,
                                &source, &g_turn_limits, &config, 7) ==
         -EINVAL);
  assert(bkvoice_ptt_initialize(&ptt, &g_audio_ops, &audio, &g_source_ops,
                                &source, &g_turn_limits, &config, 7) ==
         -EINVAL);
  assert(bkvoice_ptt_up(&ptt, 0) == -EINVAL);
}

int main(void)
{
  test_normal_ptt_order();
  test_prefill_order();
  test_prefill_failure_cleans_up();
  test_worker_failure_cancels();
  test_join_timeout_is_retryable();
  test_cancel_active_capture();
  test_cancel_join_timeout_is_retryable();
  test_capture_timeout();
  test_waiting_tts_timeout();
  test_session_close_stops_active_capture();
  test_session_close_join_timeout_is_retryable();
  test_control_sequence_overflow_is_terminal();
  test_idle_control_sequence_overflow_is_terminal();
  test_guards();
  puts("BKVOICE_PTT_HOST_PASS");
  return 0;
}
